Autodesk.Revit.DB.Electrical.CorrectionFactorSet
A set that contains correction factors.

Autodesk.Revit.DB.Electrical.CorrectionFactorSet.Insert(Autodesk.Revit.DB.Electrical.WireSize)
System.Int32
Insert the specified correction factor into the set.
item: The correction factor to be inserted into the set.
Returns: Returns whether the correction factor was inserted into the set.

Autodesk.Revit.DB.Electrical.CorrectionFactorSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.CorrectionFactorSet.ReverseIterator
Autodesk.Revit.DB.Electrical.CorrectionFactorSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Electrical.CorrectionFactorSet.ForwardIterator
Autodesk.Revit.DB.Electrical.CorrectionFactorSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.CorrectionFactorSet.Erase(Autodesk.Revit.DB.Electrical.WireSize)
System.Int32
Removes a specified correction factor from the set.
item: The correction factor to be erased.
Returns: The number of correction factors that were erased from the set.

Autodesk.Revit.DB.Electrical.CorrectionFactorSet.Contains(Autodesk.Revit.DB.Electrical.WireSize)
System.Boolean
Tests for the existence of a correction factor within the set.
item: The correction factor to be searched for.
Returns: The Contains method returns True if the correction factor is within the set, otherwise False.

Autodesk.Revit.DB.Electrical.CorrectionFactorSet.Clear
void
Removes every correction factor from the set, rendering it empty.

Autodesk.Revit.DB.Electrical.CorrectionFactorSet.Size
System.Int32
get
Returns the number of correction factors that are in the set.

Autodesk.Revit.DB.Electrical.CorrectionFactorSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.